Revit 2027 API
BuiltInFailures.DimensionFailures.LinearConstraintNotParallel Property
 The References of the highlighted Dimension are no longer parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LinearConstraintNotParallel { get; }
Public Shared ReadOnly Property LinearConstraintNotParallel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LinearConstraintNotParallel {
	FailureDefinitionId^ get ();
}
static member LinearConstraintNotParallel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace